package com.tl.web.bjts.yj.model;

/**
 * Created by wzy on 12/3/15.
 */
public enum YjzbCodeEnum {

    Z10101("10101", "新增出口商品本期金额指标"),
    Z10102("10102","新增出口商品累计金额指标"),
    Z10104("10104","新增出口商品，一二类企业需核查预警"),
    Z10105("10105","新增出口商品，其他类企业需核查预警"),
    Z10201("10201","新增供货商本期金额指标"),
    Z10202("10202","新增供货商累计金额指标"),
    Z10203("10203","新增供货商累计户数指标"),
    Z10204("10204","新增供货商，一二类企业需核查预警"),
    Z10205("10205","新增供货商，其他类企业需核查预警"),
    Z10301("10301","新企业首次出口预警"),
    Z10302("10302","中断2年以上重新申报出口退税"),
    Z10401("10401","报关单货源地与供货商不一致"),
    Z10501("10501","出口与进货商品名称不一致"),
    Z10701("10701","异常供货商本期金额指标"),
    Z10702("10702","异常供货商累计金额指标"),
    Z10703("10703","异常供货商累计户数指标"),
    Z10801("10801", "敏感商品本期金额指标"),
    Z10802("10802","敏感商品累计金额指标"),
    Z10901("10901","外贸敏感口岸本期金额指标"),
    Z10902("10902","外贸敏感口岸累计金额指标"),
    Z11001("11001","生产敏感口岸本期金额指标"),
    Z11002("11002","生产敏感口岸累计金额指标"),
    Z11101("11101","异常函调供货企业本期金额指标"),

    Z11102("11102","异常函调供货企业累计金额指标"),
    Z11103("11103","异常函调供货企业累计户数指标"),
    Z11201("11201","报关单申报与出口口岸不一致"),
    Z11301("11301","报关单单价异常指标"),
    Z11302("11302","进货单价异常指标"),
    Z11501("11501","报关行数量分散指标"),
    Z20101("20101","退税账户不一致"),
    Z20201("20201","霍尔果斯口岸毛皮出口预警"),

    Z11601("11601","近期申报数据单证备案未完成"),
    Z11701("11701","已确认征/免税业务申报退税"),
    Z11801("11801","新办类出口企业申报退税"),
    Z11901("11901","外贸企业申报数据含调整表"),
    Z12001("12001","非金华地区义务报关行预警"),
    Z13001("13001","供货企业尚未回函"),
    Z13002("13002","供货企业回函为异常"),
    Z13003("13003","供货企业回函不予退税"),
    Z16001("16001","异地报关预警"),
    Z16002("16002","生产企业货源地预警"),
    Z16003("16003","生产企业出口口岸预警"),
    Z16101("16101","商品单价畸高预警(单笔≥10万)"),
    Z16102("16102","商品单价畸高预警(≥100元)"),
    Z16103("16103","商品单价畸高预警(<100元)"),
    Z16201("16201","出口与开票时间间隔预警"),
    Z16202("16202","近期滞后开票预警次数提醒"),
    Z16301("16301","每美元利润率分析预警"),
    Z16401("16401","三三智检红码企业预警"),
    Z16402("16402","日常专项监管疑点企业预警"),
    Z16403("16403","建议调评数据未做调评处理预警"),
    Z16404("16404","三新预警单笔涉税金额超阈值预警"),
    Z16405("16405","出口企业调查评估未解除预警"),
    Z16406("16406","供货企业正在函调未回函预警"),
    Z16407("16407","出口企业正在接受稽查预警"),
    Z16408("16408","出口数据被关注预警"),
    Z16501("16501","长期未申报报关单预警"),
    Z16601("16601","收汇比例偏低预警"),
    Z12101("12101","未申报物流信息预警"),
    Z12102("12102","出口发票号码不存在预警"),
    Z12201("12201","总局下发疑点报关行预警"),
    Z12301("12301","外贸企业退税率就高申报预警"),
    Z12302("12302","生产企业退税率就低预警"),
    Z12401("12401","生产企业视同自产货物指标"),
    Z12402("12402","违规选择视同自产-1业务指标"),
    Z12403("12403","存在36个月内出口骗税、虚开发票行为指标"),
    Z12501("12501","外贸企业换汇成本超上限预警"),
    Z12502("12502","外贸企业换汇成本超下限预警")
    ;

    private String code;

    private String msg;

    YjzbCodeEnum(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public String getCode() {
        return code;
    }

    public String getMsg() {
        return msg;
    }

}
